RIET/src/Catalogs/SegmentsOfNonLawsonCompanies/SegmentsOfNonLawsonCompanies.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>SegmentsOfNonLawsonCompanies</name>
  <hierarchical>true</hierarchical>
  <owners>Catalog.LegalEntities</owners>
  <attributes>
    <name>SegmentCode</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>NameEng</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CreatedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>CreationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ModifiedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ModificationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>CostCenter</name>
    <type>
      <types>CatalogRef.КостЦентры</types>
    </type>
  </attributes>
  <attributes>
    <name>LoadedFromHOB</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

RIET/src/Catalogs/SegmentsOfNonLawsonCompanies/ObjectModule.bsl
//////////////////////////////////////////////////////////////////////
// ПРИ КОПИРОВАНИИ

Процедура ПриКопировании(ОбъектКопирования)
	
	Если Не ЭтоГруппа Тогда
		РГСофт.ОчиститьCreationModification(ЭтотОбъект);
	КонецЕсли;

КонецПроцедуры


///////////////////////////////////////////////////////////////////////////////////////
// ПЕРЕД ЗАПИСЬЮ

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ДозаполнитьРеквизиты();
	
	ПроверитьРеквизиты(Отказ);
	
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////////////

Процедура ДозаполнитьРеквизиты()
	
	Наименование = СокрЛП(Наименование);
	
	Если Не ЭтоГруппа Тогда 
		
		SegmentCode = СокрЛП(SegmentCode);
		NameEng = СокрЛП(NameEng);
		   		
		Если ЭтоНовый() Тогда
			РГСофт.ЗаполнитьCreation(ЭтотОбъект);
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////////////

Процедура ПроверитьРеквизиты(Отказ)
	
	Если ПометкаУдаления Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Владелец) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"Поле 'Legal entity' не заполнено!",
			ЭтотОбъект, "Владелец", , Отказ);
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(Наименование) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"Поле 'Name' не заполнено!",
			ЭтотОбъект, "Наименование", , Отказ);
	КонецЕсли;
	
	//проверим уникальность для владельца
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Владелец", Владелец);
	Запрос.УстановитьПараметр("Наименование", Наименование);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	SegmentsOfNonLawsonCompanies.Ссылка
	               |ИЗ
	               |	Справочник.SegmentsOfNonLawsonCompanies КАК SegmentsOfNonLawsonCompanies
	               |ГДЕ
	               |	SegmentsOfNonLawsonCompanies.Владелец = &Владелец
	               |	И SegmentsOfNonLawsonCompanies.Наименование = &Наименование
	               |	И SegmentsOfNonLawsonCompanies.Ссылка <> &Ссылка";
				   
	Выборка = Запрос.Выполнить().Выбрать();		
	Если Выборка.Следующий() Тогда 
	
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"Подразделение с таким наименованием уже существует для плательщика '" + СокрЛП(Владелец) + "'!",
			ЭтотОбъект, "Наименование", , Отказ);
	
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(CostCenter) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"Поле 'Cost center' не заполнено!",
			ЭтотОбъект, "CostCenter", , Отказ);
	КонецЕсли;
		
КонецПроцедуры
